tap "homebrew/bundle"
tap "homebrew/services"
tap "mongodb/brew"
tap "zackelia/formulae"
brew "cloc"
brew "scc"
brew "gh"
brew "git"
brew "git-lfs"
brew "jq"
brew "rcm"
brew "redis", restart_service: true
# brew "ripgrep"
brew "starship"
brew "tree"
brew "wget"
brew "trash"
# brew "bclm"
brew "mongodb/brew/mongodb-community@5.0", restart_service: :changed
brew "postgresql@16", restart_service: :changed
brew "node@20"
# Pinentry for GPG on Mac
brew "pinentry-mac"
brew "bat"
brew "rust"
brew "swiftformat"
brew "cloudflared"
brew "ffmpeg"
brew "figlet"
brew "go"


cask "visual-studio-code"
cask "orbstack"
cask "google-chrome"
# cask "arc"
cask "raycast"
cask "warp"
cask "easydict"
cask "apparency"
cask "swiftformat-for-xcode"
cask "altserver"
cask "airbattery"
cask "cursor"
cask "linear-linear"
cask "tailscale"
cask "screen-studio"
cask "craft"
cask "follow"
cask "notion"
cask "tencent-meeting"
cask "qqmusic"
cask "neteasemusic"
cask "localsend"