tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "zackelia/formulae"
brew "cloc"
brew "gh"
brew "git"
brew "git-lfs"
brew "jq"
brew "rcm"
brew "redis", restart_service: true
brew "ripgrep"
brew "starship"
brew "tree"
brew "wget"
brew "trash"
brew "bclm"
brew "mongodb/brew/mongodb-community@5.0"
brew "node"
brew "bat"

cask "visual-studio-code"
cask "orbstack"
cask "google-chrome"
cask "raycast"
cask "warp"
cask "altserver"